# 通过Apply对原始数据进行预处理

In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [3]:
ls ..\data

 驱动器 G 中的卷是 code&note
 卷的序列号是 4038-A3FC

 G:\python-data-science-intro\data 的目录

2020/02/10  08:17    <DIR>          .
2020/02/10  08:17    <DIR>          ..
2020/02/09  20:42    <DIR>          .ipynb_checkpoints
2020/02/09  20:42           195,031 apply_demo.csv
2019/05/11  23:45               423 city_weather.csv
2020/02/08  14:10         1,494,688 movie_metadata.csv
               3 个文件      1,690,142 字节
               3 个目录 13,759,995,904 可用字节

In [6]:
#apply_demo.csv
df = pd.read_csv('../data/apply_demo.csv')

In [7]:
df.shape

(3989, 2)

In [10]:
df.head()

         time                                data
0  1473411962   Symbol: APPL Seqno: 0 Price: 1623
1  1473411962   Symbol: APPL Seqno: 0 Price: 1623
2  1473411963   Symbol: APPL Seqno: 0 Price: 1623
3  1473411963   Symbol: APPL Seqno: 0 Price: 1623
4  1473411963   Symbol: APPL Seqno: 1 Price: 1649

In [14]:
# 可以看到原始数据data的元素是string
type(df['data'][0])

str

In [35]:
df['A'] = Series(['a']*3989)

In [36]:
df.head()

         time                                data  A
0  1473411962   Symbol: APPL Seqno: 0 Price: 1623  a
1  1473411962   Symbol: APPL Seqno: 0 Price: 1623  a
2  1473411963   Symbol: APPL Seqno: 0 Price: 1623  a
3  1473411963   Symbol: APPL Seqno: 0 Price: 1623  a
4  1473411963   Symbol: APPL Seqno: 1 Price: 1649  a

#### apply演示：将'A'列的所有元素a改为大写

In [37]:
df['A'] = df['A'].apply(str.upper)

In [38]:
df.head()

         time                                data  A
0  1473411962   Symbol: APPL Seqno: 0 Price: 1623  A
1  1473411962   Symbol: APPL Seqno: 0 Price: 1623  A
2  1473411963   Symbol: APPL Seqno: 0 Price: 1623  A
3  1473411963   Symbol: APPL Seqno: 0 Price: 1623  A
4  1473411963   Symbol: APPL Seqno: 1 Price: 1649  A

In [39]:
del df['A']

In [40]:
df.head()

         time                                data
0  1473411962   Symbol: APPL Seqno: 0 Price: 1623
1  1473411962   Symbol: APPL Seqno: 0 Price: 1623
2  1473411963   Symbol: APPL Seqno: 0 Price: 1623
3  1473411963   Symbol: APPL Seqno: 0 Price: 1623
4  1473411963   Symbol: APPL Seqno: 1 Price: 1649

#### apply演示：把data列spilt为多个列

In [41]:
tmp = df['data'][0].strip().split(' ')

In [42]:
tmp

['Symbol:', 'APPL', 'Seqno:', '0', 'Price:', '1623']

In [43]:
tmp[1],tmp[3],tmp[5]

('APPL', '0', '1623')

In [48]:
# 参数传入df的一行
def foo(line):
    line = line.strip().split(' ')
    return Series([line[1],line[3],line[5]])

In [55]:
df_tmp = df['data'].apply(foo)

In [59]:
df_tmp.head()

      0  1     2
0  APPL  0  1623
1  APPL  0  1623
2  APPL  0  1623
3  APPL  0  1623
4  APPL  1  1649

In [61]:
df_tmp = df_tmp.rename(columns = {0:'Symbol',1:'Seqno',2:'Price'})

In [62]:
df_tmp.head()

  Symbol Seqno Price
0   APPL     0  1623
1   APPL     0  1623
2   APPL     0  1623
3   APPL     0  1623
4   APPL     1  1649

In [63]:
# combine操作

In [64]:
df_new = df.combine_first(df_tmp)

In [65]:
df_new.head()

    Price  Seqno Symbol                                data        time
0  1623.0    0.0   APPL   Symbol: APPL Seqno: 0 Price: 1623  1473411962
1  1623.0    0.0   APPL   Symbol: APPL Seqno: 0 Price: 1623  1473411962
2  1623.0    0.0   APPL   Symbol: APPL Seqno: 0 Price: 1623  1473411963
3  1623.0    0.0   APPL   Symbol: APPL Seqno: 0 Price: 1623  1473411963
4  1649.0    1.0   APPL   Symbol: APPL Seqno: 1 Price: 1649  1473411963

In [66]:
del df_new['data']

In [68]:
df_new.head()

    Price  Seqno Symbol        time
0  1623.0    0.0   APPL  1473411962
1  1623.0    0.0   APPL  1473411962
2  1623.0    0.0   APPL  1473411963
3  1623.0    0.0   APPL  1473411963
4  1649.0    1.0   APPL  1473411963